config/gptel/sessions/hooks.org
#+title: GPTEL Session Hooks
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle hooks.el
#+auto_tangle: y

* Introduction

Session hooks provide the integration layer between gptel and the session system.
This module uses Emacs advice to intercept gptel and gptel-agent function calls,
allowing us to:
- Initialize sessions automatically
- Inject session-id into subagent contexts
- Capture streaming responses and tool calls
- Auto-save sessions after each LLM response

The advice chain order is critical:
1. =inject-session-context= runs FIRST (added last) - injects session-id
2. =capture-subagent-messages= runs SECOND - can find session-id in context
3. =trace-agent-task= wraps =gptel-agent--task= - captures agent lifecycle

* Lexical Binding

#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-
(require 'cl-lib)
#+end_src

* Advice Functions

** Trace Agent Task

#+begin_src emacs-lisp
(defun jf/gptel--trace-agent-task (orig-fn main-cb agent-type description prompt)
  "Advice around `gptel-agent--task' to capture execution trace.
Session-id is passed via :context (as overlay property or plist), records agent lifecycle."
  ;; Get session-id from parent buffer (buffer-local variable)
  (let ((session-id jf/gptel--session-id))
    (jf/gptel--log 'debug "trace-agent-task: session-id=%s, agent-type=%s" session-id agent-type)
    (if (not session-id)
        ;; No active session, run agent without tracing
        (progn
          (jf/gptel--log 'debug "trace-agent-task: No session-id, skipping trace")
          (funcall orig-fn main-cb agent-type description prompt))
      ;; Create trace entry using registry
      (let* ((parent-trace-id (jf/gptel--current-trace-id session-id))
             (trace-id (jf/gptel--create-trace session-id agent-type description
                                               prompt parent-trace-id)))
        (jf/gptel--log 'debug "trace-agent-task: Created trace-id=%s, parent=%s" trace-id parent-trace-id)

        ;; Save initial subagent prompt
        (jf/gptel--save-trace-message session-id trace-id 'prompt prompt
                                      (list :timestamp (format-time-string "%Y-%m-%dT%H:%M:%SZ")))

        ;; Wrap callback to capture completion and result
        (funcall orig-fn
                 (lambda (result)
                   (let ((status (cond
                                  ((null result) "error")
                                  ((string-prefix-p "Error:" result) "error")
                                  (t "completed"))))
                     (jf/gptel--log 'debug "trace-agent-task: Completing trace-id=%s, status=%s" trace-id status)

                     ;; Save final result if successful
                     (when (and (stringp result) (not (string-prefix-p "Error:" result)))
                       (jf/gptel--save-trace-message session-id trace-id 'result result
                                                     (list :timestamp (format-time-string "%Y-%m-%dT%H:%M:%SZ"))))

                     ;; Complete trace in registry
                     (jf/gptel--complete-trace session-id trace-id status)

                     ;; Call original callback
                     (funcall main-cb result)))
                 agent-type description prompt)))))
#+end_src

** Inject Session Context

#+begin_src emacs-lisp
(defun jf/gptel--inject-session-context (orig-fn prompt &rest args)
  "Advice around `gptel-request' to inject session-id into :context.
This allows subagents in separate buffers to access session data via registry.
If :context is an overlay (from gptel-agent), stores session-id as overlay property.
Otherwise, wraps or merges session-id into :context plist.
Also initializes session if needed BEFORE the request is sent."
  (let ((session-id jf/gptel--session-id)) ; From parent buffer
    (jf/gptel--log 'debug "inject-session-context: session-id=%s" session-id)

    ;; Initialize session if needed (autosave is enabled and in gptel-mode)
    (when (and (not session-id)
               jf/gptel-autosave-enabled
               gptel-mode
               (not (minibufferp))) ; Don't create sessions for minibuffer
      (jf/gptel--log 'debug "inject-session-context: No session-id, initializing now")
      (jf/gptel--initialize-session)
      (setq session-id jf/gptel--session-id))

    (if (not session-id)
        ;; Still no session (autosave disabled), call original
        (progn
          (jf/gptel--log 'debug "inject-session-context: No session-id, not injecting")
          (apply orig-fn prompt args))
      ;; Inject session-id into :context
      (let* ((existing-context (plist-get args :context))
             (new-context (cond
                           ;; If context is nil, create plist with session-id
                           ((null existing-context)
                            (list :session-id session-id))
                           ;; If context is an overlay (from gptel-agent), attach session-id as property
                           ((overlayp existing-context)
                            (jf/gptel--overlay-set-session-id existing-context session-id)
                            existing-context)  ; Return overlay unchanged
                           ;; If context is already a plist, merge session-id into it
                           ((and (listp existing-context)
                                 (keywordp (car existing-context)))
                            (plist-put (copy-sequence existing-context) :session-id session-id))
                           ;; Unknown type, wrap it in plist
                           (t
                            (list :original-context existing-context
                                  :session-id session-id))))
             (new-args (plist-put (copy-sequence args) :context new-context)))
        (jf/gptel--log 'debug "inject-session-context: Injected session-id into context (type: %s)"
                 (cond ((overlayp new-context) "overlay")
                       ((listp new-context) "plist")
                       (t "other")))
        (apply orig-fn prompt new-args)))))
#+end_src

