config/gptel/sessions/hooks.el
  "Advice to capture messages within subagent execution.
Wraps callback to intercept and save responses during subagent execution."
  (let* ((context (plist-get args :context))
         ;; Extract session-id from context (overlay property or plist)
         (session-id (cond
                      ((null context) nil)
                      ;; If context is overlay, get session-id from property
                      ((overlayp context)
                       (overlay-get context 'jf/session-id))
                      ;; If context is plist, get session-id from it
                      ((and (listp context) (keywordp (car context)))
                       (plist-get context :session-id))
                      (t nil)))
         (existing-callback (plist-get args :callback)))
    (if (not session-id)
        ;; Not in a traced session, pass through
        (apply orig-fn prompt args)
      ;; In a session, get current trace (if any)
      (let ((trace-id (jf/gptel--current-trace-id session-id)))
        ;; Only wrap callback if we're in a trace OR there's an existing callback
        ;; Main conversation has no :callback (uses stream processor directly)
        (if (and (not trace-id) (not existing-callback))
            ;; Main conversation with no callback - pass through without wrapping
            (progn
              (message "DEBUG capture: Skipping callback wrap for main conversation (no existing callback)")
              (apply orig-fn prompt args))
          ;; Subagent or main conversation with callback - wrap it
          (let ((wrapped-callback
               (lambda (response info)
                 ;; Log all response types for debugging
                 (message "DEBUG capture: response type=%s, trace-id=%s, session-id=%s"
                         (cond
                          ((stringp response) "string")
                          ((eq response t) "stream-end")
                          ((and (consp response) (eq (car response) 'tool-call)) "tool-call")
                          ((and (consp response) (eq (car response) 'tool-result)) "tool-result")
                          ((consp response) (format "cons:%s" (car response)))
                          (t (format "other:%s" (type-of response))))
                         trace-id session-id)
                 ;; Capture streaming text and tool completions
                 (cond
                  ;; String response (final or chunk)
                  ((and (stringp response) trace-id)
                   (when (> (length response) 0)  ; Ignore empty chunks
                     (message "DEBUG capture: Saving response chunk for trace %s" trace-id)
                     (jf/gptel--save-trace-message
                      session-id trace-id 'response response
                      (list :timestamp (format-time-string "%Y-%m-%dT%H:%M:%SZ")
                            ;; TODO: Extract token count from response metadata if available
                            :tokens 0))))

                  ;; Tool results - capture completed tool calls from FSM info
                  ((and (consp response) (eq (car response) 'tool-result))
                   (when-let* ((tool-use (plist-get info :tool-use)))
                     (if trace-id
                         (message "DEBUG capture: Capturing %d completed tools for trace %s"
                                  (length tool-use) trace-id)
                       (message "DEBUG capture: Capturing %d completed tools for session %s"
                                (length tool-use) session-id))
                     (dolist (tool-call tool-use)
                       (when (plist-get tool-call :result)
                         (message "DEBUG capture: Recording tool %s (id=%s)%s"
                                  (plist-get tool-call :name)
                                  (plist-get tool-call :id)
                                  (if trace-id (format " in trace %s" trace-id) " in main conversation"))
                         ;; Wrap in condition-case to prevent errors from breaking callback chain
                         (condition-case err
                             (jf/gptel--record-complete-tool-call session-id trace-id tool-call)
                           (error
                            (message "ERROR capturing tool call: %s" (error-message-string err))))))))

                  ;; Stream end marker
                  ((and (eq response t) trace-id)
                   (message "DEBUG capture: Stream completed for trace %s" trace-id)))

                 ;; Call original callback
                 (if existing-callback
                     (funcall existing-callback response info)
                   ;; No existing callback - this is unexpected for main conversation
                   (when (and (stringp response) (not trace-id))
                     (message "DEBUG capture: WARNING - No existing-callback for main conversation string response!"))))))
          ;; Replace callback with wrapped version
          (setq args (plist-put args :callback wrapped-callback))
          (if trace-id
              (message "DEBUG capture: Installed capture for trace %s (existing-callback: %s)"
                       trace-id (if existing-callback "present" "nil"))
            (message "DEBUG capture: Installed capture for session %s (main conversation, existing-callback: %s)"
                     session-id (if existing-callback "present" "nil")))
          (apply orig-fn prompt args)))))))
