config/gptel/sessions/hooks.el

(defun jf/gptel--autosave-session (response-start response-end)
  "Automatically save gptel session after LLM response.
RESPONSE-START and RESPONSE-END mark the response boundaries.
This function is added to `gptel-post-response-functions'."
  (when (and jf/gptel-autosave-enabled
             gptel-mode)
    (condition-case err
        (progn
          ;; Initialize session if needed
          (unless jf/gptel--session-dir
            (jf/gptel--initialize-session))

          ;; Determine message ID (branch or sequential)
          (let* ((ext (jf/gptel--get-file-extension))
                 (msg-id (if (bound-and-true-p jf/gptel--branching-next)
                             ;; Use predetermined branch ID
                             (prog1 jf/gptel--branch-id
                               (setq jf/gptel--branching-next nil)
                               (setq jf/gptel--branch-id nil))
                           ;; Normal sequential ID
                           (progn
                             (setq jf/gptel--message-counter (1+ jf/gptel--message-counter))
                             (format "message-%d" jf/gptel--message-counter))))
                 ;; Response ID matches message number
                 (resp-id (replace-regexp-in-string "message-" "response-" msg-id))
                 (msg-file (format "%s.%s" msg-id ext))
                 (resp-file (format "%s.%s" resp-id ext))
                 ;; For now, extract the last message and response
                 ;; TODO: Improve to extract exact content
                 (message-content (jf/gptel--extract-last-message response-start))
                 (response-content (buffer-substring response-start response-end))
                 (msg-preview (substring message-content 0 (min 80 (length message-content))))
                 (resp-preview (substring response-content 0 (min 80 (length response-content)))))

            ;; Save message file
            (with-temp-file (expand-file-name msg-file jf/gptel--session-dir)
              (insert message-content))

            ;; Save response file
            (with-temp-file (expand-file-name resp-file jf/gptel--session-dir)
              (insert response-content))

            ;; Sync buffer-local metadata FROM registry (get latest with traces)
            (when jf/gptel--session-id
              (when-let ((session-data (jf/gptel--get-session-data jf/gptel--session-id)))
                (setq jf/gptel--session-metadata (plist-get session-data :metadata))))

            ;; Update metadata tree (uses buffer-local metadata, which now has traces)
            (jf/gptel--update-metadata-tree msg-id msg-file msg-preview
                                            resp-id resp-file resp-preview)

            ;; Sync registry with updated buffer-local (has both tree + traces)
            (when jf/gptel--session-id
              (jf/gptel--update-session-data jf/gptel--session-id :metadata
                                             jf/gptel--session-metadata))

            ;; Link any completed traces to this message/response
            (when jf/gptel--session-id
              (when-let* ((session-data (jf/gptel--get-session-data jf/gptel--session-id))
                          (metadata (plist-get session-data :metadata))
                          (traces (plist-get metadata :agent_traces)))
                (dolist (trace (append traces nil))  ; Convert vector to list
                  (when (and (equal (plist-get trace :status) "completed")
                             (null (plist-get trace :associated_nodes)))
                    ;; This trace just completed, associate it
                    (plist-put trace :associated_nodes (vector msg-id resp-id))))
                ;; Write updated metadata
                (let ((session-dir (plist-get session-data :directory)))
                  (jf/gptel--write-metadata session-dir metadata))))

            (message "Session saved: %s/%s"
                     (file-name-nondirectory jf/gptel--session-dir)
                     resp-file)))
      (file-error
       (message "gptel autosave failed: %s" (error-message-string err)))
      (error
       (message "gptel autosave error: %s" (error-message-string err))))))

(defun jf/gptel--extract-last-message (response-start)
  "Extract user's last message before RESPONSE-START using text properties."
  (save-excursion
    (goto-char response-start)
    ;; Find start of last user message (previous property change from response)
    (let ((msg-end response-start)
          (msg-start (previous-single-property-change response-start 'gptel nil (point-min))))
      ;; If we're at a response, go back one more to get the user message
      (when (eq (get-char-property msg-start 'gptel) 'response)
        (setq msg-end msg-start)
        (setq msg-start (previous-single-property-change msg-start 'gptel nil (point-min))))
      ;; Extract and trim
      (let ((content (buffer-substring-no-properties msg-start msg-end)))
        (gptel--trim-prefixes content)))))

(defun jf/gptel--get-all-messages ()
  "Extract all message/response pairs from current buffer.
Returns list of plists: (:type 'message|'response :content string)."
  (let (messages (prev-pt (point-max)))
    (save-excursion
      (goto-char (point-max))
      (while (> prev-pt (point-min))
        (let ((prop-change (previous-single-property-change prev-pt 'gptel nil (point-min))))
          (when prop-change
            (let* ((prop (get-char-property prop-change 'gptel))
                   (content (gptel--trim-prefixes
                            (buffer-substring-no-properties prop-change prev-pt)))
                   (type (if (eq prop 'response) 'response 'message)))
              (when (and content (not (string-empty-p content)))
                (push (list :type type :content content) messages)))
            (setq prev-pt prop-change)))))
    messages))

(defun jf/gptel--get-context-before-point (pt)
  "Get all message/response pairs before point PT.
Returns list of plists in chronological order."
  (let ((context nil)
        (scan-pt (point-min)))
    (save-excursion
      (while (< scan-pt pt)
        (goto-char scan-pt)
        (let ((next-change (next-single-property-change scan-pt 'gptel nil pt)))
          (when next-change
            (let* ((prop (get-char-property scan-pt 'gptel))
                   (content (gptel--trim-prefixes
                            (buffer-substring-no-properties scan-pt next-change)))
                   (type (if (eq prop 'response) 'response 'message)))
              (when (and content (not (string-empty-p content)))
                (push (list :type type :content content) context)))
            (setq scan-pt next-change))
          (unless next-change
            (setq scan-pt pt)))))
    (nreverse context)))
