config/gptel/sessions/hooks.org
* Advice Installation

Install advice after packages load. Order is critical!

#+begin_src emacs-lisp
;; Install advice after packages load
(with-eval-after-load 'gptel-agent
  (advice-add 'gptel-agent--task :around #'jf/gptel--trace-agent-task))

(with-eval-after-load 'gptel
  ;; IMPORTANT: Order matters! Last added runs first.
  ;; capture-subagent-messages must run AFTER inject-session-context has added session-id
  ;; So we add inject-session-context LAST (it will run first in the chain)
  (advice-add 'gptel-request :around #'jf/gptel--capture-subagent-messages)
  (advice-add 'gptel-request :around #'jf/gptel--inject-session-context))

;; Install auto-save hook
(with-eval-after-load 'gptel
  (add-hook 'gptel-post-response-functions #'jf/gptel--autosave-session))
#+end_src
